Autodesk.Revit.DB.GroupTypeId.LifeSafety
"Life Safety"

Autodesk.Revit.DB.GroupTypeId.ElectricalAnalysis
"Electrical Analysis"

Autodesk.Revit.DB.GroupTypeId.AlternateUnits
"Alternate Units"

Autodesk.Revit.DB.GroupTypeId.PrimaryUnits
"Primary Units"

Autodesk.Revit.DB.GroupTypeId.RouteAnalysis
"Route Analysis"

Autodesk.Revit.DB.GroupTypeId.GeoLocation
"Geolocation"

Autodesk.Revit.DB.GroupTypeId.FabricationProductData
"Fabrication Product Data"

Autodesk.Revit.DB.GroupTypeId.SystemtypeRisedrop
"Rise / Drop"

Autodesk.Revit.DB.GroupTypeId.Lining
"Lining"

Autodesk.Revit.DB.GroupTypeId.Insulation
"Insulation"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentVGrid
"V Grid"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentUGrid
"U Grid"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPosts
"Posts"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRemainder
"Pattern Remainder"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRepeat
"Pattern Repeat"

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilySegmentPattern
"Segment Pattern (default)"

Autodesk.Revit.DB.GroupTypeId.ConceptualEnergyDataBuildingServices
"Energy Model - Building Services"

Autodesk.Revit.DB.GroupTypeId.OverallLegend
"Overall Legend"

Autodesk.Revit.DB.GroupTypeId.Visibility
"Visibility"

Autodesk.Revit.DB.GroupTypeId.Data
"Data"

Autodesk.Revit.DB.GroupTypeId.ElectricalCircuiting
"Electrical - Circuiting"

Autodesk.Revit.DB.GroupTypeId.General
"General"

Autodesk.Revit.DB.GroupTypeId.Flexible
"Adaptive Component"

Autodesk.Revit.DB.GroupTypeId.ConceptualEnergyData
"Conceptual Energy Data"

Autodesk.Revit.DB.GroupTypeId.Length
"Length"

Autodesk.Revit.DB.GroupTypeId.Area
"Area"

Autodesk.Revit.DB.GroupTypeId.AdskModelProperties
"Model Properties"

Autodesk.Revit.DB.GroupTypeId.AnalysisResults
"Analysis Results"

Autodesk.Revit.DB.GroupTypeId.LightPhotometrics
"Photometrics"

Autodesk.Revit.DB.GroupTypeId.GreenBuilding
"Green Building Properties"

Autodesk.Revit.DB.GroupTypeId.Profilen2
"Profile 2"

Autodesk.Revit.DB.GroupTypeId.Profilen1
"Profile 1"

Autodesk.Revit.DB.GroupTypeId.Profile
"Profile"

Autodesk.Revit.DB.GroupTypeId.Title
"Title Text"

Autodesk.Revit.DB.GroupTypeId.FireProtection
"Fire Protection"

Autodesk.Revit.DB.GroupTypeId.RotationAbout
"Rotation about"

Autodesk.Revit.DB.GroupTypeId.TranslationIn
"Translation in"

Autodesk.Revit.DB.GroupTypeId.Ifc
"IFC Parameters"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysis
"Energy Analysis"

Autodesk.Revit.DB.GroupTypeId.Phasing
"Phasing"

Autodesk.Revit.DB.GroupTypeId.IdentityData
"Identity Data"

Autodesk.Revit.DB.GroupTypeId.Moments
"Moments"

Autodesk.Revit.DB.GroupTypeId.Forces
"Forces"

Autodesk.Revit.DB.GroupTypeId.StructuralSectionGeometry
"Structural Section Geometry"

Autodesk.Revit.DB.GroupTypeId.StructuralAnalysis
"Structural Analysis"

Autodesk.Revit.DB.GroupTypeId.ReleasesMemberForces
"Releases / Member Forces"

Autodesk.Revit.DB.GroupTypeId.AnalyticalAlignment
"Analytical Alignment"

Autodesk.Revit.DB.GroupTypeId.AnalyticalProperties
"Analytical Properties"

Autodesk.Revit.DB.GroupTypeId.AnalyticalModel
"Analytical Model"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps
"Material Thermal Properties"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisRoomSpaceData
"Room/Space Data"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBuildingData
"Building Data"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisAdvanced
"Advanced"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisConceptualModel
"Energy Analytical Model"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedModel
"Detailed Model"

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedAndConceptualModels
"Essential"

Autodesk.Revit.DB.GroupTypeId.ViewCamera
"Camera"

Autodesk.Revit.DB.GroupTypeId.ViewExtents
"Extents"

Autodesk.Revit.DB.GroupTypeId.Support
"Supports"

Autodesk.Revit.DB.GroupTypeId.Termination
"Terminations"

Autodesk.Revit.DB.GroupTypeId.ContinuousrailEndTopExtension
"Extension (End/Top)"

Autodesk.Revit.DB.GroupTypeId.ContinuousrailBeginBottomExtension
"Extension (Beginning/Bottom)"

Autodesk.Revit.DB.GroupTypeId.RailingSystemSecondaryFamilyHandrails
"Handrail 2"

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyHandrails
"Handrail 1"

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyTopRail
"Top Rail"

Autodesk.Revit.DB.GroupTypeId.StairsTreadsRisers
"Threads/Risers"

Autodesk.Revit.DB.GroupTypeId.SplitProfileDimensions
"Dimensions     (linear units or % of thickness)"

Autodesk.Revit.DB.GroupTypeId.MechanicalLoads
"Mechanical - Loads"

Autodesk.Revit.DB.GroupTypeId.MechanicalAirflow
"Mechanical - Flow"

Autodesk.Revit.DB.GroupTypeId.Mechanical
"Mechanical"

Autodesk.Revit.DB.GroupTypeId.Geometry
"Dimensions"

Autodesk.Revit.DB.GroupTypeId.StairsWinders
"Winders"

Autodesk.Revit.DB.GroupTypeId.SlabShapeEdit
"Slab Shape Edit"

Autodesk.Revit.DB.GroupTypeId.RebarSystemLayers
"Layers"

Autodesk.Revit.DB.GroupTypeId.Structural
"Structural"

Autodesk.Revit.DB.GroupTypeId.SecondaryEnd
"Secondary End"

Autodesk.Revit.DB.GroupTypeId.PrimaryEnd
"Primary End"

Autodesk.Revit.DB.GroupTypeId.Fitting
"Fittings"

Autodesk.Revit.DB.GroupTypeId.Plumbing
"Plumbing"

Autodesk.Revit.DB.GroupTypeId.SegmentsFittings
"Segments and Fittings"

Autodesk.Revit.DB.GroupTypeId.ElectricalLoads
"Electrical - Loads"

Autodesk.Revit.DB.GroupTypeId.ElectricalLighting
"Electrical - Lighting"

Autodesk.Revit.DB.GroupTypeId.ElectricalEngineering
"Electrical Engineering"

Autodesk.Revit.DB.GroupTypeId.Electrical
"Electrical"

Autodesk.Revit.DB.GroupTypeId.Nodes
"Nodes"

Autodesk.Revit.DB.GroupTypeId.CurtainMullionn2
"Grid 2 Mullions"

Autodesk.Revit.DB.GroupTypeId.CurtainMullionHoriz
"Horizontal Mullions"

Autodesk.Revit.DB.GroupTypeId.CurtainMullionn1
"Grid 1 Mullions"

Autodesk.Revit.DB.GroupTypeId.CurtainMullionVert
"Vertical Mullions"

Autodesk.Revit.DB.GroupTypeId.Display
"Display"

Autodesk.Revit.DB.GroupTypeId.PatternApplication
"Pattern Application"

Autodesk.Revit.DB.GroupTypeId.CurtainGridV
"V Grid"

Autodesk.Revit.DB.GroupTypeId.CurtainGridU
"U Grid"

Autodesk.Revit.DB.GroupTypeId.CurtainGridn2
"Grid 2"

Autodesk.Revit.DB.GroupTypeId.CurtainGridHoriz
"Horizontal Grid"

Autodesk.Revit.DB.GroupTypeId.CurtainGrid
"Grid"

Autodesk.Revit.DB.GroupTypeId.CurtainGridn1
"Grid 1"

Autodesk.Revit.DB.GroupTypeId.CurtainGridVert
"Vertical Grid"

Autodesk.Revit.DB.GroupTypeId.Pattern
"Pattern"

Autodesk.Revit.DB.GroupTypeId.DivisionGeometry
"Division Geometry"

Autodesk.Revit.DB.GroupTypeId.StairStringers
"Stringers"

Autodesk.Revit.DB.GroupTypeId.StairRisers
"Risers"

Autodesk.Revit.DB.GroupTypeId.StairTreads
"Treads"

Autodesk.Revit.DB.GroupTypeId.Materials
"Materials and Finishes"

Autodesk.Revit.DB.GroupTypeId.Text
"Text"

Autodesk.Revit.DB.GroupTypeId.Underlay
"Underlay"

Autodesk.Revit.DB.GroupTypeId.Graphics
"Graphics"

Autodesk.Revit.DB.GroupTypeId.Reference
"Reference"

Autodesk.Revit.DB.GroupTypeId.CouplerArray
"Set"

Autodesk.Revit.DB.GroupTypeId.RebarArray
"Rebar Set"

Autodesk.Revit.DB.GroupTypeId.StairsSupports
"Supports"

Autodesk.Revit.DB.GroupTypeId.StairsOpenEndConnection
"End Connection"

Autodesk.Revit.DB.GroupTypeId.WallCrossSectionDefinition
"Cross-Section Definition"

Autodesk.Revit.DB.GroupTypeId.Construction
"Construction"

Autodesk.Revit.DB.GroupTypeId.GeometryPositioning
"Geometric Position"

Autodesk.Revit.DB.GroupTypeId.Constraints
"Constraints"

Autodesk.Revit.DB.GroupTypeId.StairsCalculatorRules
"Calculation Rules"

Autodesk.Revit.DB.GroupTypeId.TrussFamilyBottomChord
"Bottom Chords"

Autodesk.Revit.DB.GroupTypeId.TrussFamilyDiagWeb
"Diagonal Webs"

Autodesk.Revit.DB.GroupTypeId.TrussFamilyVertWeb
"Vertical Webs"

Autodesk.Revit.DB.GroupTypeId.TrussFamilyTopChord
"Top Chords"